
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗарезервированныеТовары.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
		Движение = Движения.ЗарезервированныеТовары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		Движение.Заказ = Ссылка;
		Движение.Количество = ТекСтрокаСписокНоменклатуры.Количество;
		Движение.Резерв = ТекСтрокаСписокНоменклатуры.Резерв;
	КонецЦикла;

КонецПроцедуры
