
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Покупатель = ДанныеЗаполнения.Покупатель;
		ДокОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокНоменклатуры Из ДанныеЗаполнения.СписокНоменклатуры Цикл
			НоваяСтрока = СписокНоменклатуры.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокНоменклатуры.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		КонецЦикла;
	Иначе
		Сообщить("Документ вводиться на основании заказа!");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)


Блокировка = Новый БлокировкаДанных;
ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
Блокировка.Заблокировать();

Блокировка2 = Новый БлокировкаДанных;
ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗарезервированныеТовары");
ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
Блокировка2.Заблокировать();



Движения.ОстаткиНоменклатуры.Записывать = Истина;
Движения.ОстаткиНоменклатуры.Очистить();
Движения.Записать();


Движения.ЗарезервированныеТовары.Записывать = Истина;
Движения.ЗарезервированныеТовары.Очистить();
Движения.Записать();

Движения.ОстаткиНоменклатуры.Записывать = Истина;
Движения.ЗарезервированныеТовары.Записывать = Истина;



Запрос = Новый("Запрос");
МВТ = Новый("МенеджерВременныхТаблиц");
Запрос.МенеджерВременныхТаблиц = МВТ;
Запрос.Текст ="ВЫБРАТЬ
              | РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
              | СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
              | СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма,
              | МАКСИМУМ(РасходнаяНакладнаяСписокНоменклатуры.НомерСтроки) КАК НомерСтроки
              |ПОМЕСТИТЬ ДокТЧ
              |ИЗ
              | Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
              |ГДЕ
              | РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
              |
              |СГРУППИРОВАТЬ ПО
              | РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
              |
              |ИНДЕКСИРОВАТЬ ПО
              | Номенклатура
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | ОстаткиНоменклатурыОстатки.Номенклатура,
              | ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК ОстатокКол,
              | ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СебестоимостьОстаток, 0) КАК ОстатокСум
              |ПОМЕСТИТЬ ОстаткиПоСкладу
              |ИЗ
              | РегистрНакопления.ОстаткиНоменклатуры.Остатки(
              |   &ТочкаИтогов,
              |   Номенклатура В
              |     (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |      ДокТЧ.Номенклатура
              |     ИЗ
              |      ДокТЧ)
              |    И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | ОстаткиНоменклатурыОстатки.Номенклатура,
              | ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК ОстатокКол
              |ПОМЕСТИТЬ ОстаткиПоВсемСкладам
              |ИЗ
              | РегистрНакопления.ОстаткиНоменклатуры.Остатки(
              |   &ТочкаИтогов,
              |   Номенклатура В
              |    (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |     ДокТЧ.Номенклатура
              |    ИЗ
              |     ДокТЧ)) КАК ОстаткиНоменклатурыОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | РезервОстатки.Номенклатура,
              | ЕСТЬNULL(РезервОстатки.КоличествоОстаток, 0) КАК Остаток,
              | ЕСТЬNULL(РезервОстатки.РезервОстаток, 0) КАК Резерв
              |ПОМЕСТИТЬ РезервПоЗаказу
              |ИЗ
              | РегистрНакопления.ЗарезервированныеТовары.Остатки(
              |   &ТочкаИтогов,
              |   Заказ = &Заказ
              |    И Номенклатура В
              |     (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |      ДокТЧ.Номенклатура
              |     ИЗ
              |      ДокТЧ)) КАК РезервОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | РезервОстатки.Номенклатура,
              | ЕСТЬNULL(РезервОстатки.КоличествоОстаток, 0) КАК КолОст,
              | ЕСТЬNULL(РезервОстатки.РезервОстаток, 0) КАК КолРез
              |ПОМЕСТИТЬ РезервПоДругимЗаказам
              |ИЗ
              | РегистрНакопления.ЗарезервированныеТовары.Остатки(
              |   &ТочкаИтогов,
              |   Заказ <> &Заказ
              |    И Номенклатура В
              |     (ВЫБРАТЬ РАЗЛИЧНЫЕ
              |      ДокТЧ.Номенклатура
              |     ИЗ
              |      ДокТЧ)) КАК РезервОстатки
              |;
              |
              |////////////////////////////////////////////////////////////////////////////////
              |ВЫБРАТЬ
              | ДокТЧ.Номенклатура,
              | ДокТЧ.Количество,
              | РезервПоЗаказу.остаток КАК ОстатокТекЗаказа,
              | РезервПоЗаказу.Резерв КАК РезервТекЗаказа,
              | РезервПоДругимЗаказам.КолОст КАК ОстатокДрЗаказов,
              | РезервПоДругимЗаказам.КолРез КАК РезервДрЗаказов,
              | ЕСТЬNULL(ОстаткиПоСкладу.ОстатокКол, 0) КАК ОстатокНаСкладеКол,
              | ЕСТЬNULL(ОстаткиПоСкладу.ОстатокСум, 0) КАК ОстатокНаСкладеСум,
              | ОстаткиПоВсемСкладам.ОстатокКол КАК ОбщийОстаток,
              | ЕСТЬNULL(ОстаткиПоВсемСкладам.ОстатокКол, 0) - ЕСТЬNULL(РезервПоДругимЗаказам.КолРез, 0) КАК СвободныйОстаток
              |ИЗ
              | ДокТЧ КАК ДокТЧ
              |  ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСкладу КАК ОстаткиПоСкладу
              |  ПО ДокТЧ.Номенклатура = ОстаткиПоСкладу.Номенклатура
              |  ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоВсемСкладам КАК ОстаткиПоВсемСкладам
              |  ПО ДокТЧ.Номенклатура = ОстаткиПоВсемСкладам.Номенклатура
              |  ЛЕВОЕ СОЕДИНЕНИЕ РезервПоЗаказу КАК РезервПоЗаказу
              |  ПО ДокТЧ.Номенклатура = РезервПоЗаказу.Номенклатура
              |  ЛЕВОЕ СОЕДИНЕНИЕ РезервПоДругимЗаказам КАК РезервПоДругимЗаказам
              |  ПО ДокТЧ.Номенклатура = РезервПоДругимЗаказам.Номенклатура";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("ТочкаИтогов", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
Запрос.УстановитьПараметр("Склад", Склад);
Запрос.УстановитьПараметр("Заказ", ДокОснование );

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл

	Если Выборка.Количество> Выборка.СвободныйОстаток Тогда
	Сообщить("Для Номенклатуры " + Выборка.номенклатура +" требуемое количество " + Выборка.Количество+"превышает свободный остаток "+ Выборка.СвободныйОстаток);
	Отказ = Истина;
	ИначеЕсли Выборка.Количество > Выборка.ОстатокНаСкладеКол Тогда
	Сообщить("Для Номенклатуры " + Выборка.номенклатура +" требуемое количество " + Выборка.Количество+"превышает  остаток на складе "+ Выборка.ОстатокНаСкладеКол);
	Отказ = Истина;


КонецЕсли;
КонецЦикла;

Если Выборка.ОстатокНаСкладеКол = 0 Тогда
	
	Себест = Выборка.ОстатокНаСкладеСум;
Иначе
	Себест = Выборка.Количество / Выборка.ОстатокНаСкладеКол * Выборка.ОстатокНаСкладеСум;

КонецЕсли;

Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
Движение.Период = Дата;
Движение.Номенклатура = Выборка.Номенклатура;
Движение.Склад = Склад;
Движение.Количество = Выборка.Количество;
Движение.Себестоимость = Себест;

Движение = Движения.ЗарезервированныеТовары.ДобавитьРасход();
Движение.Период = Дата;
Движение.Заказ = ДокОснование;
Движение.Номенклатура = Выборка.Номенклатура;
Движение.Количество = Выборка.Количество;


КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = 0;
	Для Каждого СтрокаТЧ ИЗ СписокНоменклатуры Цикл
		СуммаПоДокументу = СтрокаТЧ.Сумма;
	КонецЦикла;
КонецПроцедуры



