
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДокОснование) Тогда
	Отказ = Истина;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущиеДанныеСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанныеСписокНоменклатуры.Сумма = ТекущиеДанныеСписокНоменклатуры.Количество * ТекущиеДанныеСписокНоменклатуры.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекущиеДанныеСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанныеСписокНоменклатуры.Сумма = ТекущиеДанныеСписокНоменклатуры.Количество * ТекущиеДанныеСписокНоменклатуры.Цена;
КонецПроцедуры


