
Процедура ОбработкаПроведения(Отказ, Режим)    
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаСписокНоменклатуры.Количество;
		Движение.Себестоимость = ТекСтрокаСписокНоменклатуры.Сумма;
	КонецЦикла;

КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = 0;
	
	Для Каждого СтрокаТЧ ИЗ СписокНоменклатуры Цикл
		
		СуммаПоДокументу = СуммаПоДокументу + СтрокаТЧ.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

